{
  "usa": {
    "title": "Plumbing Services Across the USA | State-by-State Guide",
    "description": "Explore state-specific plumbing issues, licensing requirements, average repair and replacement costs, and regional water-quality impacts on pipes. This guide highlights common problems by region (hard-water scale in the Southwest, freeze damage in the Northeast, tree-root sewer intrusion in the Midwest), typical permit and inspection expectations, and how local building codes affect repairs and remodels. Learn where Cardinal Plumbing Solutions operates, how to find licensed contractors in your state, and what to expect for emergency response times.<br/>For immediate service or to schedule an inspection with Cardinal Plumbing Solutions, call [phone] or visit cardinalplumbingsolutions.com."
  },
  "roof-types": {
    "title": "Learn About Popular Types of Plumbing Systems & Their Uses",
    "description": "Understand the most common plumbing systems and when each is appropriate: supply piping options (PEX, copper, CPVC), drain-waste-vent systems (PVC, ABS, cast iron), hydronic heating, tank and tankless water heaters, sewage ejectors, and sump pump setups. We cover pros and cons for new construction versus retrofit, compatibility with water heaters and filtration systems, and energy-efficiency considerations. Whether you need repiping, a new hot-water system, or sewer-line replacement, Cardinal Plumbing Solutions can recommend the right system for your property.<br/>Call [phone] to speak with a system specialist or visit cardinalplumbingsolutions.com for examples and system comparison guides."
  },
  "roof-materials": {
    "title": "Find Out The Best Plumbing Materials For Your Home",
    "description": "Compare plumbing materials—PEX, copper, CPVC, PVC, cast iron, and stainless steel—by durability, cost, ease of installation, corrosion resistance, freeze tolerance, and suitability for potable water or drainage. Learn signs that piping should be replaced (pinholes, green/blue staining, low water pressure, recurring leaks), best choices for hot-water lines versus main supply, and recommended materials for sewer line replacement. Get guidance on material warranties, expected lifespans, and local code considerations to make an informed decision for repairs or upgrades.<br/>Request a free material assessment and written estimate from Cardinal Plumbing Solutions by calling [phone] or booking online at cardinalplumbingsolutions.com."
  }
}